In [1]:
# Import libraries
import pandas as pd
import sys

In [2]:
# Our small data set
d = {'one':[1,1,1,1,1],
     'two':[2,2,2,2,2],
     'letter':['a','a','b','b','c']}

# Create dataframe
df = pd.DataFrame(d)
df

  letter  one  two
0      a    1    2
1      a    1    2
2      b    1    2
3      b    1    2
4      c    1    2

In [3]:
# Create group object
one = df.groupby('letter')

# Apply sum function
one.sum()

        one  two
letter
a         2    4
b         2    4
c         1    2

In [4]:
letterone = df.groupby(['letter','one']).sum()
letterone

            two
letter one
a      1      4
b      1      4
c      1      2

In [5]:
letterone.index

MultiIndex(levels=[['a', 'b', 'c'], [1]],
           labels=[[0, 1, 2], [0, 0, 0]],
           names=['letter', 'one'])

In [6]:
letterone = df.groupby(['letter','one'], as_index=False).sum()
letterone

  letter  one  two
0      a    1    4
1      b    1    4
2      c    1    2

### Test using lambda

In [14]:
import numpy as np

data = {'c1':np.random.randint(1, 5, 10), 
        'c2':np.random.randint(1, 20, 10),
        'c3':np.random.randint(1, 20, 10), }

df = pd.DataFrame(data)
        
df

   c1  c2  c3
0   1   7   4
1   1  11   3
2   1   3   1
3   4   8   5
4   3  17  18
5   1  18  15
6   4   2  17
7   1  14  11
8   2   4   6
9   4   3  14

In [21]:
key = lambda x: x%2

byc1 = df.groupby(key)

In [23]:
df2 = df.set_index('c1')

In [31]:
byc1 = df2.groupby(key)
maxc1 = byc1.transform(lambda x: x.max())
minc1 = byc1.transform(lambda x: x.min())
trc1 = byc1.transform(lambda x: x.max() - x.min())

In [34]:
minc1['c2']

c1
1    3
1    3
1    3
4    2
3    3
1    3
4    2
1    3
2    2
4    2
Name: c2, dtype: int64

In [38]:
df2['min'] = minc1['c2']
df2['max'] = maxc1['c2']
df2['diff'] = trc1['c2']

df2.sort_index()

    c2  c3  min  max  diff
c1
1    7   4    3   18    15
1   11   3    3   18    15
1    3   1    3   18    15
1   18  15    3   18    15
1   14  11    3   18    15
2    4   6    2    8     6
3   17  18    3   18    15
4    8   5    2    8     6
4    2  17    2    8     6
4    3  14    2    8     6